# 만들기
s1 = set([1, 2, 3])

print("집합", s1) # 집합 {1, 2, 3}

s1= {1, 2, 3}
print('집합', s1) # 집합 {1, 2, 3}

s1 = set('hello')
print("집합", s1) # 집합 {'l', 'e', 'h', 'o'}

s1 = set([1, 2, 3, 4, 5, 6])
s2 = set([4, 5, 6, 7, 8, 9])

# 교집합 
print("교집합", s1 & s2) # 교집합 {4, 5, 6}

print (s1.intersection(s2)) # {4, 5, 6}

# 합집합 
print('합집합', s1 | s2) # 합집합 {1, 2, 3, 4, 5, 6, 7, 8, 9}

print(s1.union(s2)) # {1, 2, 3, 4, 5, 6, 7, 8, 9}

# 차집합 
print("차집합", s1 - s2) # 차집합 {1, 2, 3}

print(s1.difference(s2)) # {1, 2, 3}

# 추가 
s1.add(7)
print(s1) # {1, 2, 3, 4, 5, 6, 7}

# 여러 개 추가 
s1.update([8, 9, 10])
print(s1) # {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

# 제거 하기 
s1.remove(10)

print(s1) # {1, 2, 3, 4, 5, 6, 7, 8, 9}